app/controllers/places_controller.rb

SELECT  "places".* FROM "places"  WHERE "places"."id" = 2 LIMIT 1
---
  def show
	@place = Place.find_by(:id => params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 1 LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 1
---
  def delete
	place = Place.find_by(:id => params["id"])
	place.delete

SELECT  "places".* FROM "places"  WHERE "places"."id" = 2 LIMIT 1
---
  def edit
	@place = Place.find_by(:id => params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 0 LIMIT 1
UPDATE "places" SET "description" = ? WHERE "places"."id" = 1  [["description", "The ragged old market of Spite is known for its silk-weavers and its pickpockets. Blythenhale is notorious for its feral cats."]]
---
  def update
	@place = Place.find_by(:id => params["id"])
	@place.title = params["title"]
	@place.photo_url = params["photo_url"]
	@place.price = params["price"]
	@place.description = params["description"]
	@place.save

INSERT INTO "places" ("description", "photo_url", "price", "title") VALUES (?, ?, ?, ?)  [["description", "It's Maru!"], ["photo_url", "http://i.ytimg.com/vi/KchQwqMG-C4/maxresdefault.jpg"], ["price", 5], ["title", "Maru"]]
---
  def create
	place = Place.new(:title => params["title"], :photo_url => params["photo_url"], :price => params["price"], :description => params["description"])
	place.save